Revit 2024 API
ParameterTypeId.BendingDetailSegmenetRepesentation Property
 "Representation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId BendingDetailSegmenetRepesentation { get; }
Visual Basic
Public Shared ReadOnly Property BendingDetailSegmenetRepesentation As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ BendingDetailSegmenetRepesentation {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace